aaron-bond.better-comments
adpyke.codesnap
alefragnani.bookmarks
anthropic.claude-code
eamodio.gitlens
formulahendry.code-runner
github.remotehub
johnpapa.vscode-peacock
kevinrose.vsc-python-indent
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.tensorboard
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
oderwat.indent-rainbow
pnp.polacode
sbsnippets.pytorch-snippets
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
tomoki1207.pdf
yzane.markdown-pdf
